app/controllers/favorites_controller.rb

INSERT INTO "favorites" ("created_at", "gist_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Wed, 31 Jul 2013 20:51:49 UTC +00:00], ["gist_id", nil], ["updated_at", Wed, 31 Jul 2013 20:51:49 UTC +00:00], ["user_id", 1]]
---
  def create
    @favorite = Favorite.new(params[:favorite])
    @favorite.user_id = current_user.id

    if @favorite.save

SELECT "favorites".* FROM "favorites" WHERE "favorites"."gist_id" IS NULL AND "favorites"."user_id" = 1 LIMIT 1
---
  def show
    @favorite = Favorite.find_by_gist_id_and_user_id(params[:gist_id], current_user.id)