app/controllers/gists_controller.rb

  def create
    @gist = Gist.new(params[:gist])
    if @gist.save
---
INSERT INTO "gists" ("created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Wed, 31 Jul 2013 18:21:20 UTC +00:00], ["title", "Happy Gist"], ["updated_at", Wed, 31 Jul 2013 18:21:20 UTC +00:00], ["user_id", 1]]